In [1]:
import pandas as pd
import numpy as np

In [5]:
pd.read_csv("datas/pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [8]:
pd.read_csv("datas/pokemon.csv",index_col="Pokemon")

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [21]:
a = pd.read_csv("datas/pokemon.csv",index_col="Pokemon").squeeze()
a

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [19]:
a.nunique()

159

In [20]:
a.count()

809

In [25]:
a.describe()

count        809
unique       159
top       Normal
freq          65
Name: Type, dtype: object

In [29]:
a.sort_values(ascending=False) #

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [28]:
a.sort_index()

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [33]:
pd.read_csv("datas/google_stocks.csv",
           parse_dates=["Date"],
           index_col = "Date",
           )

              Close
Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
...             ...
2019-10-21  1246.15
2019-10-22  1242.80
2019-10-23  1259.13
2019-10-24  1260.99
2019-10-25  1265.13

[3824 rows x 1 columns]

In [34]:
pd.read_csv("datas/google_stocks.csv",
           parse_dates=["Date"],
           index_col = "Date",
           ).squeeze()

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [57]:
pd.read_csv("datas/google_stocks.csv",
           
           index_col = "Date",
           ).squeeze()

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [55]:
pd.read_csv("datas/revolutionary_war.csv",
            parse_dates=["Start Date"],
           index_col = "Start Date",
            usecols = ["Start Date", "State"]
           ).squeeze()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [46]:
a.describe()

count                162
unique                17
top       South Carolina
freq                  31
Name: State, dtype: object

In [42]:
pd.read_csv("datas/revolutionary_war.csv",
            
           index_col = "Start Date",
            usecols = ["Start Date", "State"]
           )

                    State
Start Date
9/1/1774    Massachusetts
12/14/1774  New Hampshire
4/19/1775   Massachusetts
4/19/1775   Massachusetts
4/20/1775        Virginia
...                   ...
9/11/1782        Virginia
9/13/1782             NaN
10/18/1782            NaN
12/6/1782             NaN
1/22/1783        Virginia

[232 rows x 1 columns]

In [54]:
pd.read_csv("datas/revolutionary_war.csv",
            parse_dates=["Start Date"],
           index_col = "Start Date",
            usecols = ["Start Date", "State"]
           )

                    State
Start Date
1774-09-01  Massachusetts
1774-12-14  New Hampshire
1775-04-19  Massachusetts
1775-04-19  Massachusetts
1775-04-20       Virginia
...                   ...
1782-09-11       Virginia
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
1783-01-22       Virginia

[232 rows x 1 columns]

In [61]:
a.notnull().sum()

162

In [62]:
a.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [65]:
a.sort_index(na_position="first")

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [68]:
a.sort_index(na_position="last")

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [80]:
a.loc[a.index.notnull()] #이게 더 정확하다.
a.loc[a.index.dropna()] #dropna()를 쓰려면 index의 중복이 없어야 한다.

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [92]:
# 인덱스에서 결측치 제거 
a.index.dropna()

# 밸류에서 결측치 제거 
a.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [71]:
a.[a.index.notnull()]
a.loc[a.index.notnull()]

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [79]:
z = pd.read_csv("datas/google_stocks.csv",
           parse_dates=["Date"],
           index_col = "Date",
           ).squeeze()

z1 = z.sort_values(ascending=True)
z2 = z.sort_values(ascending=False)
print(z1.head(10))
print()
print(z2.head(10))

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [94]:
z.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [95]:
z.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [96]:
a.value_counts()

South Carolina    31
New York          28
New Jersey        24
Virginia          21
Massachusetts     11
Pennsylvania      10
North Carolina     9
Florida            8
Georgia            6
Rhode Island       3
Connecticut        3
Vermont            3
New Hampshire      1
Delaware           1
Indiana            1
Louisiana          1
Ohio               1
Name: State, dtype: int64

In [98]:
a = pd.read_csv("datas/google_stocks.csv",
           parse_dates=["Date"],
           index_col = "Date",
           ).squeeze()
a.value_counts(bins = [0,200,400,1000])

(200.0, 400.0]     1568
(400.0, 1000.0]    1162
(-0.001, 200.0]     595
Name: Close, dtype: int64

In [103]:
a = pd.read_csv("datas/google_stocks.csv",
           parse_dates=["Date"],
           index_col = "Date",
           ).squeeze()
a.value_counts(bins=(0,200,400,600,800,1000,1200,1400)).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [104]:
a.value_counts(bins=8,sort=False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [114]:
data = {"c1":["1","2","누락"],
       "c2":[1.11, '',3.33],
       "c3":["one","two","three"]}
columns = ["c1","c2","c3"]
df_csv = pd.DataFrame(data,
                columns=columns)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [116]:
a = df_csv.to_csv("datas/sample1.csv",index=False)

In [123]:
%pwd

'c:\\python'

In [122]:
%cd c:\\python

c:\python

In [147]:
df_read = pd.read_csv("datas/sample1.csv", na_values=['누락'])
df_read

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [129]:
b = df_csv.to_csv("datas/sample2.csv",index=False, header=False)

In [130]:
pd.read_csv('datas/sample2.csv', names=['c1','c2','c3'])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [132]:
%%writefile datas/sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing datas/sample3.txt

In [141]:
pd.read_table('datas/sample3.txt',sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [143]:
%%writefile datas/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting datas/sample4.txt

In [144]:
pd.read_table('datas/sample4.txt',skiprows=[0,1])

       c1, c2, c3
0    1, 1.11, one
1    2, 2.22, two
2  3, 3.33, three

In [148]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [149]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [150]:
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [151]:
titanic.head(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y

In [206]:
import requests
import xmltodict

response = requests.get('http://openapi.seoul.go.kr:8088/sample/xml/negoContractInfo/1/5/')
print(response.status_code)
print(response.headers)
# print(f"인코딩: {response.encoding}")
# print(f"콘텐츠 타입: {response.headers['Content-Type']}")
# print(f"서버: {response.headers['Server']}")

a = xmltodict.parse(response.text)
# a['negoContractInfo']['list_total_count']
# a['negoContractInfo']['RESULT']
b = a['negoContractInfo']['row']
b
c = pd.DataFrame(b)
c


# import pandas as pd
# df = pd.DataFrame(response)
# df

# print(df['message'].count())

200
{'Date': 'Tue, 07 Mar 2023 08:04:15 GMT', 'Content-Encoding': 'UTF-8', 'Content-Type': 'application/xml;charset=UTF-8', 'Transfer-Encoding': 'chunked', 'Server': 'Jetty(9.2.19.v20160908)'}
인코딩: UTF-8
콘텐츠 타입: application/xml;charset=UTF-8
서버: Jetty(9.2.19.v20160908)

,RNUM,T2_OFFICE_CD,VIEW_OFFICE_NM,SET_OFFICE_CD,SET_OFFICE_NM,PROPOSE_DEPT_NM,GOV_OFFICE_CD,GOV_OFFICE_NM,UNT_GRP,FIS_YEAR,...,DEPT_CD,APP_YMD,APPRAISE_PLACE,APPRAISE_MEMBER,PROPOSAL_ENTERPRISE,APPRAISE_RESULT,INS_DATE,UPD_DATE,ORIGINAL_FILENAME,GCC_DEPT_CD
0,3403,2,서울시(사업소),1105,상수도사업본부,상수도사업본부 공간정보과,0030,상수도사업본부,10,2022,...,1105317,2202-04-04,상수도사업본부 4층 대회의실,8,2,평가결과.hwp,2022-04-05 16:57:02.0,2022-04-05 16:57:02.0,평가결과.hwp,6114103
1,3402,2,서울시(사업소),1105,상수도사업본부,상수도사업본부 급수운영과,0030,상수도사업본부,10,2023,...,1105305,2023-03-07,상수도사업본부 4층 회의실,7,3,"평가결과(서부,강서,강동).hwp",2023-03-07 16:26:55.0,2023-03-07 16:26:55.0,"평가결과(서부,강서,강동).hwp",6113212
2,3401,2,서울시(사업소),1105,상수도사업본부,상수도사업본부 급수운영과,0030,상수도사업본부,10,2023,...,1105305,2023-03-07,서울시상수도사업본부 4층 회의실,7,3,"평가위원별 평가점수 결과공개(동부,북부,강남).hwpx",2023-03-07 16:39:11.0,2023-03-07 16:39:11.0,"평가위원별 평가점수 결과공개(동부,북부,강남).hwpx",6113212
3,3400,2,서울시(사업소),1091,문화본부,서울도서관 도서관정책과,1064,서울도서관,10,2023,...,1091007,2023-03-06,서울도서관 사서교육장(4F),7,2,제안서평가위원회 결과(광화문 책마당 행사공간 실시설계 및 제작설치용역).hwp,2023-03-07 16:10:22.0,2023-03-07 16:10:45.0,제안서평가위원회 결과(광화문 책마당 행사공간 실시설계 및 제작설치용역).hwp,6113196
4,3399,1,서울시(본청),1005,관광체육국,관광체육국 관광산업과,0010,본청,10,2023,...,1091004,2023-03-03,한국프레스센터 5층 관광산업과 회의실,6,1,평가위원별 평가점수 결과(계약마등 등록용).hwp,2023-03-03 17:24:23.0,2023-03-03 17:25:45.0,평가위원별 평가점수 결과(계약마등 등록용).hwp,6113875

In [246]:
import requests

response = requests.get(	
"http://openapi.seoul.go.kr:8088/sample/xml/ksccPatternStation/1/5/")
response.status_code

response.headers

# import json
# print(response.json().keys())
# response = response.json()
import xmltodict
xmltodict.parse(response.text)
import pandas as pd
pd.DataFrame(xmltodict.parse(response.text)['ksccPatternStation']['row']).describe()

,CRTR_DT,PASNG_PTTRN,TOT_PSGRCNT,TOT_PSGRCNT_PEPL,TOT_PSGRCNT_CHILD,TOT_PSGRCNT_BYNGR,TOT_PSGRCNT_ODPSN,TOT_PSGRCNT_DABLPSN
count,5,5,5,5,0,1,0,0
unique,1,5,5,5,0,1,0,0
top,20230302,①[지하철] → ②[버스] → ③[경기버스] → ④[버스] → ⑤[지하철],7,6,NaN,1,NaN,NaN
freq,5,1,1,1,NaN,1,NaN,NaN

In [24]:
a =[i for i in "abcdefghijklmnopqrstuvwxyz"]

a.index('d')

26

In [ ]:
13 15 14 (3)   20 21 5 (5)    23 5 3 (4)
13 11 12       6  5  21       3  21 23